Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: Nevertheless, Ānanda, bodhisattva great beings should reach a very full understanding by practicing the perfection of generosity; by practicing the perfection of ethical discipline; by practicing the perfection of tolerance; by practicing the perfection of perseverance; by practicing the perfection of meditative concentration; by practicing the perfection of wisdom; by practicing all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and by practicing [the goals], up to and including all-aspect omniscience. {

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་།
en: Ki.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པས་ནི་ཤིན་དུ་རྟོགས་པར་བྱ་སྟེ། ཤིན་དུ་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་པ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་སྤྱོད་པ་དང་།
en: V: 71} Bodhisattva great beings with a very full understanding who practice the perfection of generosity; who practice the perfection of ethical discipline; who practice the perfection of tolerance; who practice the perfection of perseverance; who practice the perfection of meditative concentration and the perfection of wisdom; who practice the emptiness of internal phenomena; who practice [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; who practice the applications of mindfulness; who practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; who practice [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas; and who practice [the goals], up to and including all-aspect omniscience, do not become śrāvakas or pratyekabuddhas. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་ནི་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སུ་མི་འགྱུར་རོ། །དགའ་བོ་དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཁྱོད་ལ་གཏད་དེ། དགའ་བོ་གལ་ཏེ་ཁྱོད་ཀྱིས།
en: Therefore, Ānanda, I entrust this profound perfection of wisdom to you.

source: ངས་ཆོས་གང་ཇི་སྙེད་ཅིག་བཤད་པ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་གཏོགས་པར་ངས་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་བཟུང་སྟེ། ཀུན་ཆུབ་པར་བྱས་ནས། དེའི་འོག་ཏུ་ཆུད་གསན་ཏེ་བོར་ཡང་དེ་ཙམ་གྱིས་དགའ་བོ་ཁྱོད་ལ་སྐྱོན་དུ་ངས་མི་བརྩིའི། དགའ་བོ་གལ་ཏེ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བཟུང་སྟེ།
en: Ānanda, even if, among all those doctrines that I have explained, you were to subsequently squander and discard all those teachings of mine that you have held and mastered, with the exception of the perfection of wisdom, then, Ānanda, I would not consider you to be at fault on that account.

source: ཀུན་ཆུབ་པར་བྱས་ནས། དེའི་འོག་ཏུ་ཆུད་གསན་ཏམ། བོར་བར་གྱུར་ན་དེས་ནི། དགའ་བོ་ཁྱོད་ལ་ངས་སྐྱོན་དུ་གཟུང་ངོ་། །དགའ་བོ་དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཁྱོད་ལ་གཏད་ཀྱིས།
en: On the other hand, Ānanda, if you were to subsequently squander or discard this profound perfection of wisdom that you have held and mastered, then, Ānanda, I would consider you to be at fault on that account.

source: ཅི་ནས་ཀྱང་གཟུང་བ་དང་། བཅང་བ་དང་། ཀླག་པ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཤིན་དུ་ཡིད་ལ་གཟུང་བར་གྱིས་ཤིག །
en: Therefore, Ānanda, you should take up, uphold, recite, and master it by all means!

source: ལེགས་པར་ཡོངས་སུ་ཟིན་པ་དང་། ལེགས་པར་ཀུན་ཆུབ་པ་དང་།
en: You should absolutely hold it in your mind.

source: ལེགས་པར་བཅང་བར་གྱིས་ཤིག །ཡི་གེ་དང་། ཚིག་དང་། འབྲུ་ཤིན་ཏུ་རྫོགས་པ་དང་། ངེས་པའི་ཚིག་ཤིན་དུ་ལེགས་པར་ཟིན་པར་བྱའོ། །དགའ་བོ་རིགས་ཀྱི་བུ་འམ།
en: You should grasp it well, master it well, retain it well, absolutely perfect its letters, words, and syllables, and absolutely and properly comprehend its definitions. “

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དེས་ནི། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བྱང་ཆུབ་བཟུང་བར་འགྱུར་རོ།
en: Ānanda, any noble sons or noble daughters who take up, uphold, recite, and master this profound perfection of wisdom will uphold the enlightenment of the lord buddhas of the past, future, and present.

source: །དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དེས་ནི། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བྱང་ཆུབ་འཐུན་པར་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །དགའ་བོ་མངོན་དུ་གྱུར་པར་ང་ལ་གང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: Ānanda, any noble sons or noble daughters who hold this profound perfection of wisdom will facilitate the enlightenment of the lord buddhas of the past, future, and present.

source: བ་དན་གྱིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་བསྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བར་འདོད་པ་དེས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་གཟུང་བར་བྱ། བཅང་བར་བྱ། ཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱའོ།
en: Ānanda, those who wish to serve, respect, honor, and worship it in my presence, with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, and ribbons, should take up, uphold, recite, and master this profound perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བཟུང་སྟེ། བཅངས་ནས་བླགས་ཤིང་། ཀུན་ཆུབ་པར་བྱ་སྟེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་རིམ་གྲོར་བྱ། །བཀུར་སྟིར་བྱ། བསྟི་སྟང་དུ་བྱ། མཆོད་པར་བྱའོ།
en: After taking up, upholding, and reciting this profound perfection of wisdom, they should master it, and serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners and ribbons.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱས་ན་དེས་ནི་ང་ཡང་མཆོད་པར་འགྱུར། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་མཆོད་པར་འགྱུར་རོ།
en: If they serve, respect, honor, and worship the perfection of wisdom, they will also worship me, and they will also worship the lord buddhas of the past, future, and present.

source: །དགའ་བོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པ་ལ་རིམ་གྲོ་དང་།
en: Ānanda, when this profound perfection of wisdom {Ki.

source: དགའ་བ་དང་། མོས་པ་བསྐྱེད་པ་དེས་ནི། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་རིམ་གྲོ་དང་།
en: V: 72} is being taught, any who serve, delight, and believe in it will serve, delight, and believe in the lord buddhas of the past, future, and present.

source: དགའ་བ་དང་། མོས་པ་བསྐྱེད་པར་འགྱུར་རོ། །དགའ་བོ་གལ་ཏེ་ཁྱོད་ལ་ང་སྡུག་ཅིང་ཡིད་དུ་འོང་བས་ཡོངས་སུ་མ་བཏང་ཞེ་ན། དགའ་བོ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་སྡུག་པ་དང་། ཡིད་དུ་འོང་བ་དང་།
en: Ānanda, if you have not forsaken me because I am dear and pleasant to you, then, Ānanda, this perfection of wisdom will be dear and pleasant to you, and you should not forsake it.

source: ཡོངས་སུ་མི་བཏང་བ་གྱིས་ཤིག །ཅི་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་ཚིག་འགའ་ཡང་ཁྱོད་ཀྱིས་ཆུད་མ་ཟོས་པར་གྱིས་ཤིག །
en: You should by all means not squander even a single word of this profound perfection of wisdom. “

source: དགའ་བོ་ངས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་གཏང་བར་བརྩམས་ཏེ། ཁྱོད་ལ་ཤིན་དུ་མང་དུ་བསྟན་པ་ཡང་མདོར་ན། དགའ་བོ་ཁྱོད་ལ་ང་ཇི་ལྟར་སྟོན་པར་གྱུར་པ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་ཁྱོད་ཀྱི་སྟོན་པ་ཡིན་གྱི།
en: Ānanda, as I begin to entrust this profound perfection of wisdom, although I have imparted a great persony teachings to you, in short, Ānanda, just as I have been your teacher, so this perfection of wisdom is also your teacher.

source: དགའ་བོ་དེ་བས་ན་ངས་ཁྱོད་ལ་ཚད་མེད་པར་གཏད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཡོངས་སུ་གཏད་དེ།
en: Therefore, Ānanda, with this measureless bestowal, I entrust this profound perfection of wisdom to you.

source: དགའ་བོ་དེ་བས་ན་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་བརྗོད་དེ། སུས་སངས་རྒྱས་ཡོངས་སུ་མ་བཏང་བ་དང་། ཆོས་ཡོངས་སུ་མ་བཏང་བ་དང་། དགེ་འདུན་ཡོངས་སུ་མ་བཏང་བ་དང་། འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡོངས་སུ་མ་བཏང་བ་དང་། འདས་པ་དང་། མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་མ་བཏང་བ་དེས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོངས་སུ་བཏང་བར་མི་བྱ་སྟེ།
en: Therefore, Ānanda, I declare in the presence of the world with its gods, humans, and asuras, that anyone who would not forsake the Buddha, who would not forsake the Dharma, who would not forsake the Saṅgha, who would not forsake the lord buddhas of the past, future, and present, and who would not forsake the enlightenment of the lord buddhas of the past, future, and present, should not forsake this perfection of wisdom.

source: འདི་ནི་ངའི་གདམས་ངག་གོ །དགའ་བོ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། འཕེལ་བར་བྱེད་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། གཞན་ལ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་རྣམ་གྲངས་དུ་མར་རྒྱ་ཆེར་འཆད་པ་དང་། སྟོན་པ་དང་རབ་ཏུ་སྟོན་པ་དང་། ཤེས་པར་བྱེད་པ་དང་།
en: This is my instruction! “

source: རབ་ཏུ་གཞོག་པ་དང་། འགྲེལ་པ་དང་། རྣམ་པར་འབྱེད་པ་དང་། གསལ་བར་བྱེད་པ་དང་། ཡང་དག་པར་སྟོན་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: Ānanda, any noble sons or noble daughters who take up, uphold, recite, propagate, and master this profound perfection of wisdom, focusing their attention correctly on it, and also with many formulations extensively explain, teach, indicate, make known, establish, interpret, analyze, elucidate, and genuinely reveal this profound perfection of wisdom to others, will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་གྱུར་པ་ཡིན།
en: They are approaching all-aspect omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྟེ། དགའ་བོ་འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ལས་བྱུང་ངོ་།
en: If you ask why, Ānanda, it is because the unsurpassed, complete enlightenment of the lord buddhas, which brought forth all the tathāgatas, arhats, completely awakened buddhas of the past, also originated from this very perfection of wisdom.

source: །དགའ་བོ་མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ལས་འབྱུང་བར་འགྱུར་རོ། །དགའ་བོ་ད་ལྟར་བྱུང་བའི་དུས་ན་ཤར་ཕྱོགས་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་།
en: Ānanda, the unsurpassed, complete enlightenment of the lord buddhas, which will bring forth all the tathāgatas, arhats, completely awakened buddhas of the future, will also originate from this very perfection of wisdom.

source: ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ལས་བྱུང་ངོ་།
en: Ānanda, the unsurpassed, complete enlightenment of the lord buddhas who are alive at present as all the tathāgatas, arhats, completely awakened buddhas of the present, teaching the Dharma in the countless, immeasurable, and inestimable world systems of the eastern, southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, also originates from this very perfection of wisdom. {

source: །དགའ་བོ་དེ་བས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སློབ་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བསླབ་པར་བྱའོ།
en: Ki.V: 73} “Therefore, Ānanda, bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment, and who wish to train in the six perfections, should train in this profound perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མ་སྟེ་སྐྱེད་པར་བྱེད་པའོ།
en: If you ask why, Ānanda, it is because the perfection of wisdom is the mother who gives birth to bodhisattva great beings.

source: །དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སློབ་པ་དེ་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འགྱུར་ཏེ།
en: Ānanda, all those bodhisattva great beings who train in the six perfections will be emancipated in unsurpassed, complete enlightenment.

source: དགའ་བོ་དེ་བས་ན་ཁྱོད་ལ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཡང་དང་ཡང་ཡོངས་སུ་གཏད་དོ།
en: Therefore, Ānanda, I entrust and further entrust these six perfections to you, again and again.

source: །རྗེས་སུ་གཏད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཛོད་དེ།
en: If you ask why, Ānanda, this is the repository of the Dharma of the tathāgatas, arhats, completely awakened buddhas.

source: འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་མཛོད་ནི་ཟད་མི་ཤེས་པའི་ཆོས་ཀྱི་མཛོད་དོ།
en: This repository of the six perfections is the inexhaustible repository of the Dharma. “

source: །དགའ་བོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་མཛོད་འདི་ལས་ཆོས་སྟོན་ཏོ།
en: Ānanda, even those lord buddhas who are alive at present—all the tathāgatas, arhats, completely awakened buddhas who teach the Dharma in the countless, immeasurable, and inestimable world systems of the ten directions—teach the Dharma that derives from this repository of the six perfections.

source: །དགའ་བོ་འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་བསླབས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ་ཆོས་སྟོན་ཏོ།
en: Ānanda, even all those tathāgatas, arhats, completely awakened buddhas who appeared in the past have trained in these six perfections, and taught the Dharma, having attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །དགའ་བོ་མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བ་དེ་དག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་བསླབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། ཆོས་ཀྱང་སྟོན་པར་འགྱུར་རོ།
en: Ānanda, even all those tathāgatas, arhats, completely awakened buddhas who will appear in the future will train in these six perfections, and teach the Dharma, having attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །དགའ་བོ་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཉན་ཐོས་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: Ānanda, even all those who are the śrāvakas of the lord buddhas of the past, future, and present have passed into final nirvāṇa, are passing into final nirvāṇa, and will pass into final nirvāṇa, after training in this very perfection of wisdom. “

source: །དགའ་བོ་གལ་ཏེ་ཁྱོད་ཀྱིས་གང་ཟག་ཉན་ཐོས་ཀྱི་ཐེགས་པ་པ་རྣམས་ལ་ཉན་ཐོས་ཀྱིས་བརྩམས་ཏེ། ཆོས་བསྟན་པའི་ཆོས་བསྟན་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་པར་གྱུར་ཀྱང་། ད་རུང་ཉན་ཐོས་ཁྱོད་ཀྱིས་ངའི་ཉན་ཐོས་ཀྱི་བྱ་བ་བྱས་པར་མི་འགྱུར་གྱི།
en: Ānanda, even if you were to teach the Dharma, commencing with [the level of] the śrāvakas, to individuals who follow the vehicle of the śrāvakas, and all the beings that there are in the world system of the great trichiliocosm were, on the basis of that teaching of the Dharma, to realize the state of arhatship, you, a śrāvaka, would not yet perform the deeds of my śrāvakas.

source: དགའ་བོ་གལ་ཏེ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཚིག་འགའ་ཞིག་བརྗོད་དེ་བསྟན་ན། ཉན་ཐོས་ཁྱོད་ཀྱིས་ང་དགྱེས་པར་བྱས་པ་ཡིན་ཏེ། ཉན་ཐོས་ཀྱིས་ཉན་ཐོས་ཀྱི་བྱ་བ་བྱས་པར་འགྱུར་རོ།
en: But, Ānanda, if you were to speak and teach to bodhisattva great beings even a single word associated with the perfection of wisdom, you, a śrāvaka, would please me, and, being a śrāvaka, you would perform the deeds of a śrāvaka. “

source: །དགའ་བོ་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་བསྟན་པ་སྔ་མ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་པར་གྱུར་ན། དགྲ་བཅོམ་པ་དེ་དག་གི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དེ་དག་མང་ངམ།
en: Ānanda, if all the beings of the world system of the great trichiliocosm were to realize, sooner or later, the state of arhatship on the basis of your former teaching of the Dharma, do you think that there would be many foundations of merit arising from the generosity of those arhats, and many foundations of merit arising from their ethical discipline and arising from their meditation?” {

source: །བཅོམ་ལྡན་འདས་མང་ངོ་།
en: V: 74} “Yes, there would, Blessed Lord!

source: དགའ་བོ་དེ་བས་གང་ཟག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཆུང་ངུ་ན་ཉི་མ་གཅིག་ཅིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་སྟོན་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་རོ། །དགའ་བོ་ཉིན་གཅིག་ལྟ་ཞོག་གི །གལ་ཏེ་ཉི་མ་ཕྱེད་དམ། དགའ་བོ་ཉི་མ་ཕྱེད་ལྟ་ཞོག་གི །གལ་ཏེ་སྔ་དྲོ་གཅིག་གམ།
en: Ānanda,” continued the Blessed One, “if individuals who follow the vehicle of the śrāvakas were to teach the Dharma associated with the perfection of wisdom to bodhisattva great beings for at least one day, their merit would increase more greatly than that.

source: དགའ་བོ་སྔ་དྲོ་གཅིག་ལྟ་ཞོག་གི །གལ་ཏེ་ཆུ་ཚོད་གཅིག་ཙམ་འམ། དགའ་བོ་ཆུ་ཚོད་གཅིག་ཙམ་ལྟ་ཞོག་གི །གལ་ཏེ་སྐད་འགའ་ཡུད་འགའ་ཐང་འགའ་ཞིག་གང་ཟག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་བསྟན་ན།
en: Ānanda, leaving aside one day, if individuals who follow the vehicle of the śrāvakas were to teach the Dharma associated with the perfection of wisdom to bodhisattva great beings for half a day; or, Ānanda, leaving aside half a day, if they were to do so for one morning; or, Ānanda, leaving aside one morning, if they were to do so for about twenty-four minutes; or, Ānanda, leaving aside twenty-four minutes, if they were to do so for an instant, a moment, or a split second, then, Ānanda, their merit would increase more greatly.

source: དགའ་བོ་དེའི་བསོད་ནམས་ནི་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡང་དེས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ། །དགའ་བོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་རྣམས་ལ་ཆུང་ངུ་ན་ཉི་མ་གཅིག་གམ།
en: They would surpass even the roots of virtuous action of all those noble sons or noble daughters who follow the vehicles of the śrāvakas and pratyekabuddhas. “

source: ཉི་མ་ཕྱེད་དམ་སྔ་དྲོ་གཅིག་གམ། ཆུ་ཚོད་གཅིག་ཙམ་འམ། སྐད་འགའ་ཡུད་འགའ་ཐང་འགའ་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་སྟོན་ན། དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཟིལ་གྱིས་ནོན་པར་འགྱུར་ཏེ།
en: Ānanda, if bodhisattva great beings were to teach the Dharma associated with the perfection of wisdom to individuals who follow the vehicle of the bodhisattvas for at least one day, or half a day, or one morning, or about twenty-four minutes, or an instant, a moment, or a split second, then, Ānanda, those bodhisattva great beings would surpass the roots of virtuous action of all noble sons or noble daughters who follow the vehicles of the śrāvakas and pratyekabuddhas. “

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ལ། གཞན་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་ཞིང་། ཡང་དག་པར་དགའ་བར་བྱེད་པ་ཡིན། ཡང་དག་པར་སྤྲོ་བར་བྱེད་པ་ཡིན། ཡང་དག་པར་གཞོག་པ་ཡིན། ཡང་དག་པར་འགོད་པ་ཡིན་ཏེ།
en: If you ask why, it is because they themselves wish to attain consummate buddhahood in unsurpassed, complete enlightenment, and they also encourage others toward unsurpassed, complete enlightenment, causing them to rejoice and delight, exhorting them, and establishing them in it.

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་སྤྱོད་པ་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: Ānanda, it is impossible that the roots of virtuous action of bodhisattva great beings who practice the six perfections in that manner; who practice the four applications of mindfulness; who practice the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path; who practice the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; who practice the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and who practice [the goals], up to and including all-aspect omniscience, would dwindle when in fact they increase manifold.
